In [1]:
import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [7]:
df = pd.read_excel('실습.xlsx')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
a=pd.read_excel("실습.xlsx",header=None)
a

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [9]:
a=pd.read_excel("실습.xlsx",names=['a','b','c','d','message'])
a

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
a='a,b,guido'

In [15]:
a.split(',')

['a', 'b', 'guido']

In [16]:
pieces=[x.strip() for x in a.split(',')]

In [17]:
pieces

['a', 'b', 'guido']

In [18]:
first,second,third=pieces

In [19]:
first+','+second+','+third

'a,b,guido'

In [20]:
','.join(pieces)

'a,b,guido'

In [21]:
'guido' in a

True

In [22]:
a.find(':')

-1

In [23]:
a.count(',')

2

In [24]:
import re

In [25]:
text='foo    bar\t baz \tqux'

In [26]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [27]:
regex=re.compile('\s+')

In [28]:
regex

re.compile(r'\s+', re.UNICODE)

In [29]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [30]:
regex.findall(text)

['    ', '\t ', ' \t']

In [31]:
text='Dave dave@google.com Steve steve@gmail.com Rob rob@gmail.com Ryan ryan@yahoo.com'

In [32]:
pattern=r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

In [38]:
regex=re.compile(pattern, flags=re.IGNORECASE)

In [39]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [40]:
m=regex.search(text)

In [41]:
m

In [42]:
df1=pd.DataFrame({'key': ['b','b','a','c','a','a','b'],
                'data1':range(7)})

In [43]:
df2=pd.DataFrame({'key': ['a','b','d'],
                'data2':range(3)})

In [44]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [45]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [46]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [47]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [48]:
df3=pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],
                 'data1':range(7)})

In [49]:
df4=pd.DataFrame({'rkey': ['a','b','d'],
                'data2':range(3)})

In [50]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [51]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [52]:
 pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [53]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [54]:
df1=pd.DataFrame({'key':['b','b','a','c','a','b'],
                 'data1':range(6)})

In [55]:
df2=pd.DataFrame({'key':['a','b','a','b','d'],
                 'data2':range(5)})

In [56]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [57]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [58]:
pd.merge(df1,df2,on='key',how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [59]:
left=pd.DataFrame({'key1':['foo','foo','bar'],
                  'key2':['one','two','three'],
                  'lval':[1,2,3]})

In [60]:
right=pd.DataFrame({'key1':['foo','foo','bar','bar'],
                  'key2':['one','two','three','two'],
                  'lval':[4,5,6,7]})

In [61]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1   key2  lval_x  lval_y
0  foo    one     1.0       4
1  foo    two     2.0       5
2  bar  three     3.0       6
3  bar    two     NaN       7

In [62]:
left

  key1   key2  lval
0  foo    one     1
1  foo    two     2
2  bar  three     3

In [63]:
right

  key1   key2  lval
0  foo    one     4
1  foo    two     5
2  bar  three     6
3  bar    two     7

In [64]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval_x key2_y  lval_y
0  foo    one       1    one       4
1  foo    one       1    two       5
2  foo    two       2    one       4
3  foo    two       2    two       5
4  bar  three       3  three       6
5  bar  three       3    two       7

In [65]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval_left key2_right  lval_right
0  foo       one          1        one           4
1  foo       one          1        two           5
2  foo       two          2        one           4
3  foo       two          2        two           5
4  bar     three          3      three           6
5  bar     three          3        two           7